#+TITLE: January 10-25, 2020 (16 days)
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2020-01-10 Fri>
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :wpd-kurianbenoy: 4
  :END:
** bhavin192
*** IN_PROGRESS Write blog post about Helm v3
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1577718004
    :TASKID:   WRITE.1577718004
    :END:
    :LOGBOOK:
    CLOCK: [2020-01-15 Wed 20:15]--[2020-01-15 Wed 21:00] =>  0:45
    :END:
*** DONE CNCF Project Webinar: A Conversation about Helm 3
    CLOSED: [2020-01-15 Wed 00:33]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       EVENT.1578852275
    :TASKID:   EVENT.1578852275
    :END:
    :LOGBOOK:
    CLOCK: [2020-01-14 Tue 23:29]--[2020-01-15 Wed 00:33] =>  1:04
    :END:
    [[https://zoom.us/webinar/register/1515768748019/WN_NhXnvAT_RQiNJr7LMn4ILA]]
*** DONE Attend Rootconf Delhi 2020
    CLOSED: [2020-01-18 Sat 17:30]
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       EVENT.1578852044
    :TASKID:   EVENT.1578852044
    :END:
    :LOGBOOK:
    CLOCK: [2020-01-18 Sat 09:30]--[2020-01-18 Sat 17:30] =>  8:00
    :END:

** gandalfdwite
*** Blog Post on year 2019 and OBM
   :PROPERTIES:
   :ESTIMATED: 4
   :ACTUAL:
   :OWNER: gandalfdwite
   :ID: WRITE.1578812481
   :TASKID: WRITE.1578812481
   :END:
   - [ ] Write blog post on year 2019    ( 4h )
*** Containerize pravarag dot com
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: DEV.1578812553
    :TASKID: DEV.1578812553
    :END:
    - [ ] Write Nginx based dockerfiles     ( 2h )
    - [ ] CI/CD pipeline to enable code     ( 4h )
          changes and updating docker
          images
    - [ ] Write K8s based deployment specs  ( 4h )
          as helm charts
    - [ ] CI/CD to update Helm charts       ( 2h )

** kurianbenoy
*** Compete in Kaggle DSBowl competition - Part2
    :PROPERTIES:
    :ESTIMATED: 15
    :ACTUAL:
    :OWNER: kurianbenoy
    :ID: DEV.1578594699
    :TASKID: DEV.1578594699
    :END:
    - [ ] Try lightGM model
    - [ ] Stack top scoring models
    - [ ] Create local CV
*** Prepare for GATE 2020 - Part2
    :PROPERTIES:
    :ESTIMATED: 26
    :ACTUAL:
    :OWNER: kurianbenoy
    :ID: READ.1578594810
    :TASKID: READ.1578594810
    :END:
    - [ ] TOC
    - [ ] Compiler design
    - [ ] Databases
    - [ ] Digital Logic
    - [ ] Datastructures and programming
*** Read CTCI part-3
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: kurianbenoy
    :ID: READ.1578594906
    :TASKID: READ.1578594906
    :END:
    - [ ] Dynammic Programming
*** Project: Malayalam text to speech system
    :PROPERTIES:
    :ESTIMATED: 18
    :ACTUAL:
    :OWNER: kurianbenoy
    :ID: DEV.1578595021
    :TASKID: DEV.1578595021
    :END:
    - [ ] Write survey paper
    - [ ] complete making inital TTS system

